Revit 2027 API
AssetProperties.IsValidIndex Method
 Returns true if the provided index is valid.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidIndex(
	int index
)
Public Function IsValidIndex (
	index As Integer
) As Boolean
public:
bool IsValidIndex(
	int index
)
member IsValidIndex :
        index : int -> bool
Parameters
index Int32
 Index to be validated.
Return Value
Boolean
 True if index is valid, false otherwise.
See Also
Reference
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace